/* 
 * File:   I2C.h
 * Author: Dante_L_Levi
 *
 * Created on 12 февраля 2018 г., 20:29
 */

#ifndef I2C_H
#define	I2C_H


#include "Main.h"



//=====================================Прототипы============================
/*
 * ===========================Функция инициализации=====
 *      Принимаемые параметры:
 *              c-скорость передачи/приема данных
 */

void I2C_Master_Init(unsigned long int c);

/*
 * ===========================Функция ожидание передачи данных=========
 */
void I2C_Master_Wait(void);

/*
 ===========================Функция Старта работы I2C===============
 */
void I2C_Master_Start(void);


/*
 ============================Функция Перезапуска интерфейса==========
 */
void I2C_Master_RepeatedStart(void);

/*
 ==============================Функция остоновки интерфейса==========
 */
void I2C_Master_Stop(void);


/*
 =====================Функция записи данных в буффер===========
 *      Принимаемые параметры:
 *              data- данные для передачи
 */
void I2C_Write_Byte(unsigned char data);

void I2C_SendByteByADDR(unsigned char c,unsigned char addr);
/*
 ============================Функция чтения байта==============
 
 
 */
unsigned char I2C_Master_Read(unsigned char a);



/*
 =======================Функция инициализации в режиме Slave==============
 *          Принимаемые параметры:
 *                  adress-адрес вемого устройства
 */

void I2C_Slave_Init(short address) ;




#endif	/* I2C_H */

