#include "ADClib.h"
#include <xc.h>

float Vref=0;

/*
 ======================Функция инициализации АЦП-----------------
 */
void ADC_Init(float Uref)
{
    //---------------Настроим тактирование АЦП(F/8)--------
    ADCS0=1;
    ADCS1=0;
    //------------------------------------------------
    
    
    //--------------------Включаем разрешение преобразования---------
    ADON=1;
    //---------------------------------------------------------------
    //--------------------------вкл. все каналы как аналоговые входы----------
    PCFG0=0;
    PCFG1=0;
    PCFG2=0;
    PCFG3=0;
    //------------------------------------------------------------------------
    
    //--------------------------------Формат преобразования--------------------
    ADFM=1;
    //-------------------------------------------------------------------------
    
    
    Vref=Uref;
}


/*
    ---------------------------------Функция чтения данных из регистра АЦП---------------------
 *                      Принимаемые параметры:
 *                          channel-канал по которому будет считыватся значения
 *                      Возращаемое значение:
 *                          данные из регистра АЦП
 */
unsigned int ADC_Read(unsigned char channel)
{
    if(channel > 7) //If Invalid channel selected 
    return 0;     //Return 0
    
    
    ADCON0 &= 0xC5;
   ADCON0 |= channel<<3;
   __delay_ms(2);
   GO_nDONE = 1;
   while(GO_nDONE);
   return ((ADRESH<<8)+ADRESL);
}



/*
 =============================Преобразование в напряжение---------------------
 *      Принимаемые параметры:
 *              channel-канал по которому будет считыватся значения
 *      Возращаемые параметры:
 *              значение напряжения в вещественном виде
 */
float Get_Voltage(unsigned char channel)
{
    float voltage=((ADC_Read(channel)*Vref)/1024.0);
    
    return voltage;
    
}



